app/controllers/api/v1/posts_controller.rb

      def index
        #query database
        #posts = ModelName.order('created_at DESC');
        posts = Post.order('created_at DESC');
---
SELECT `posts`.* FROM `posts` ORDER BY created_at DESC

      def show
        post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1